# درس چهارم مبحث لیست ها در پایتون

# درپایتون لیست ها را برای مجموعه ای از پارامترها را که درون متغیر ذخیره میشوند بکار میبرند
# لیست ها مقادیر مختلفی را میتواند درون خود ذخیره کند مثل رشته ها و اعداد و حتی بولین ها و هر پارامتر رو با کاما در لیست ها جداسازی یا تفکیک میکنند
# به کد زیر دقت کنید که یک لیست را تعریف کرده که دوتا پارامتر از نوع رشته درون خود ذخیره کرده
names = ["Ali", "Saeed"]

# با استفاده از دستور پرینت میتوان به پارامترها یا مقادیر یک لیست دست پیدا کرد 
print(names)

# به لیست زیر توجه کنید که مقادیری از اعداد را در خود ذخیره کرده
numbers = [1, 2, 3, 4, 5]

# چاپ لیست اعداد
print(numbers)

# لیست زیر پارامترهایی از دو متد بولین یعنی True و False رو درون خود ذخیره کرده
boolean = [True, False]
print(boolean)

# دقت داشته باشید که در یک لیست ما میتوانیم هر مقدار یا پارامتر از انواع متغیرها مثلا رشته و اعداد و حتی بولین درون یک لیست ذخیره کنیم

# لیستی از مجموعه ای از رشته و عدد و حتی بولین
collections = ["Nahid", 23, True, "Reza", "Hamid", False, 28, 18]

print(collections)

# جمع بندی درس امروز اینکه چرا از لیست ها استفاده میکنیم بخاطر اینکه از تکرار و نوشتن چندین متغیر جلوگیری بشه و لیست ها میتواند مجموعه ای از مقادیر را که در چندین متغیر مجبور به نوشتن آن هستم جلوگیری میکنه و همه مقادیر رو به راحتی درون خود ذخیره میکند