# در این درس با متدهایی که روی متغیرها که مقادیرشان از نوع عددی است اجرا میشوند آشنا میشویم

# متدها به شرح زیر است
# abs()
# round()
# max()
# min()
# sum()

# abs()
# این متد قدر مطلق یک عدد را برمیگرداند
num = -5
print(abs(num))

print('----------------------------------')

# round()
# این متد عدد را به نزدیکترین عدد صحیح یا اعشاری برمیگرداند
num2 = 5.6789
print(round(num2, 2))

print('----------------------------------')

# max()
# این متد بزرگترین عدد را از یک مجموعه بازمیگرداند
numbers = [1,2,3,4]
print(max(numbers))

print('----------------------------------')

# min()
# این متد کوچکترین عدد را از یک لیست برمیگرداند
numbers2 = [1,2,3,4,5]
print(min(numbers2))

print('----------------------------------')

# sum()
# این متد جمع کل اعداد یک لیست را برمیگرداند
numbers3 = [2,5,7]
print(sum(numbers3))