# در پایتون چندین متد وجود دارد که با استفاده از آنها میتوان روی متغیرها عملیات مختلفی انجام داد 
# در این درس ما قرار است با متدهایی که میتوان روی متغیرهای از نوع رشته و نامبر عملیات مختلفی انجام داد آشنا بشیم
#متدهایی که رو متغیرهای از نوع رشته میتوان استفاده کرد
# upper()
# این متد تمام حروف متغیر از نوع رشته را تبدیل به حروف بزرگ میکند

name = "ahmadreza"
print(name.upper());

print('----------------------------------')

# lower()
# این متد برای تبدیل حروف بزرگ به حروف کوچک استفاده میشود

my_name = "ANDERSON"
print(my_name.lower());

print('----------------------------------')

# replace()
# این متد برای جایگزیرن کردن یک رشته با رشته ای درون یک متغیر استفاده میشود
text = "Hello world"
new_text = text.replace("world", "python")
print(new_text)

print('----------------------------------')

# split()
# این متد پارامترهای یک متغیر از نوع رشته را درون یک لیست بصورت جداگانه از هم تفکیک و جداسازی میکند
strings = "apple,orange,banana"
fruits = strings.split(",")
print(fruits)

print('----------------------------------')

# join()
# این متد لیستی از رشته هارا به یک رشته واحد تبدیل میکند
my_fruits = ["orange", "banana", "apple"]
my_strings = ", ".join(my_fruits)
print(my_strings)

print('----------------------------------')

# strip()
# این متد فضاهای خالی اول و آخر رشته اا در متغیرها را حذف میکند
text2 = "  hallo  "
print(text2.strip())

print('----------------------------------')

# find()
# این متد موقعیت اولین زیر رشته را برمیگرداند
text3 = "Hello Python"
position = text3.find('Hello')
print(position)

print('----------------------------------')

# startswith()
# این متد بررسی میکند آیا رشته با یک زیر رشته خاص شروع میشود یا نه 
# نکته مهم اینکه جوابی که برمیگرداند از نوع بولین است True یا False

text4 = "Hello everyone"
print(text4.startswith('Hello'))

print('----------------------------------')

# endswith()
# این متد بررسی میکند آیا رشته با یک زیر رشته به پایان میرسد یا نه 
# نکته جواب بصورت True یا False است

text5 = "Hello friends"
print(text5.endswith("friends"))