# درس دوم آموزش تعریف متغیر از نوع فلوت یا اعشاری
num = 12.75

# چاپ و نمایش مقدار متغیر
print(num)

# تبدیل یک متغیر فلوت به یک متغیر عدد صحیح یا integer
int_num = int(num)

# چاپ و نمایش متغیر num که به عدد صحیح تبدیل شده
print(int_num)

# اضافه کردن مقدار به یک متغیر که در اینجا به یک متغیر اعشاری مقداری را اضافه میکنیم
x = 10.5
x += 2.5
# چاپ متغیر ایکس
print(x)

# اگر بخواهیم از متغیر کم کنیم به صورت زیر عمل میکنیم
x -= 1.5
print(x)

print('-------------------------------')

# استفاده از عملگرهای مقایسه ای و چهار عمل اصلی در ریاضی مثل جمع و تفریق و ضرب و تقسیم

# دوتا متغیر با مقادیر مختلف مثل زیر بنویسید

a = 10
b = 3

sum_result = a + b # عملیات جمع
print(sum_result)

sub_result = a - b # عملیات تفریق
print(sub_result)

mul_result = a * b # عملیات ضرب
print(mul_result)

div_result = a / b # تقسیم معمولی
print(div_result)

int_div_result = a // b # بدون اعشار
print(int_div_result)

mod_result = a % b # باقیمانده تقسیم
print(mod_result)

power_result = a ** b # عملیات توان ۱۰ به توان ۳
print(power_result)


print('-------------------------------')

# استفاده از عملگرهای مقایسه ای برای سنجیدن مقادیر دو متغیر

# آشنایی با علامت های عملگرهای مقایسه ای
# == برابر بودن دو مقدار متغیر
# != برابر نبودن دو مقدار متغیر
# > بزرگتر بودن یک متغیر نسبت به متغیر دیگر
# < کوچکتر بودن یک متغیر نسبت به متغیر دیگر
# >= بزرگتر یا مساوی
# <= کوچکتر یا مساوی

# به کدهای زیر دقت کنید و نحوه استفاده از عملگرها رو برای مقایسه و سنجیدن دو متغیر رو به خوبی متوجه خواهید شد 
# توجه داشته باشید که هنگام چاپ مقادیری که برمیگرداند بصورت True یعنی درست وFalse یعنی غلط که بولین است برمبگردد

d = 15
h = 10

print(d == h) # False یعنی برابر نیست
print(d != h) # True یعنی مقدارشان متفاوت است
print(d > h) # True یعنی درست است بزرگتر است 
print(d < h) # False یعنی علط است کوچکتر نیست
print(d >= h) # True یعنی بزرگتر مساوی است پس درست است
print(d <= h) # False یعنی کوچکتر مساوی نیست و d بزرگتر است